tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
    /* Start the RTOS scheduler. */
    vTaskStartScheduler();

    /* Infinite loop */
    for(;;)
    {
        
    }
}
/*-----------------------------------------------------------*/

#if USE_UDP

    static void prvCliTask( void *pvParameters )
    {
        uint32_t ulResponseLength;
        BaseType_t xCount, xResponseRemaining, xResponseSent;
        Socket_t xCLIServerSocket = FREERTOS_INVALID_SOCKET;
        struct freertos_sockaddr xSourceAddress, xServerAddress;
        socklen_t xSourceAddressLength = sizeof( xSourceAddress );
        TickType_t xCLIServerRecvTimeout = portMAX_DELAY;
        char * pcOutputBuffer = FreeRTOS_CLIGetOutputBuffer();

        ( void ) pvParameters;

        xCLIServerSocket = FreeRTOS_socket( FREERTOS_AF_INET,
                                            FREERTOS_SOCK_DGRAM,
                                            FREERTOS_IPPROTO_UDP );
        configASSERT( xCLIServerSocket != FREERTOS_INVALID_SOCKET );

        /* No need to return from FreeRTOS_recvfrom until a message
        * is received. */
        FreeRTOS_setsockopt( xCLIServerSocket,
                            0,
                            FREERTOS_SO_RCVTIMEO,
                            &( xCLIServerRecvTimeout ),
                            sizeof( TickType_t ) );

        xServerAddress.sin_port = FreeRTOS_htons( configCLI_SERVER_PORT_UDP );

        #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
            xServerAddress.sin_address.ulIP_IPv4 = FreeRTOS_GetIPAddress();
        #else
            xServerAddress.sin_addr = FreeRTOS_GetIPAddress();
        #endif

        FreeRTOS_bind( xCLIServerSocket, &( xServerAddress ), sizeof( xServerAddress ) );

        configPRINTF( ( "Waiting for requests...\n" ) );

        for( ;; )
        {
            uint8_t ucRequestId[ 4 ];

    #if USE_ZERO_COPY

                uint8_t *pucReceivedUDPPayload = NULL;
                xCount = FreeRTOS_recvfrom( xCLIServerSocket,
                                            &pucReceivedUDPPayload,
                                            0,
                                            FREERTOS_ZERO_COPY,
                                            &( xSourceAddress ),
                                            &( xSourceAddressLength ) );

                configASSERT( (pucReceivedUDPPayload != NULL) && (xCount < configMAX_COMMAND_INPUT_SIZE));

                memcpy(( void * )( &( cInputCommandString[ 0 ] ) ), pucReceivedUDPPayload, xCount);

                FreeRTOS_ReleaseUDPPayloadBuffer( ( void * ) pucReceivedUDPPayload );

    #else

                xCount = FreeRTOS_recvfrom( xCLIServerSocket,
                                            ( void * )( &( cInputCommandString[ 0 ] ) ),
                                            configMAX_COMMAND_INPUT_SIZE,
                                            0,
                                            &( xSourceAddress ),
                                            &( xSourceAddressLength ) );

    #endif /* USE_ZERO_COPY */

            /* Since we set the receive timeout to portMAX_DELAY, the
            * above call should only return when a command is received. */
            configASSERT( xCount > 0 );
            cInputCommandString[ xCount ] = '\0';

            if( prvIsValidRequest( ( const uint8_t * ) &( cInputCommandString[ 0 ] ), xCount, &( ucRequestId[ 0 ] ) ) == pdTRUE )
            {
                uint8_t ucPacketNumber = 1;
    #ifdef TIM7_TEST
                extern uint32_t tim7_period;

                #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                #else
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_addr,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                #endif

    #else

                #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ) ) );
                #else
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ) ) );
                #endif

    #endif
                do
                {
                    /* Send the received command to the FreeRTOS+CLI. */
                    xResponseRemaining = FreeRTOS_CLIProcessCommand( &( cInputCommandString[ PACKET_HEADER_LENGTH ] ),
                                                                        pcOutputBuffer,
                                                                        configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 );

                    /* Ensure null termination so that the strlen below does not
                    * end up reading past bounds. */
                    pcOutputBuffer[ configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 ] = '\0';

