tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
                    ulResponseLength = strlen( pcOutputBuffer );

                    /* HACK - Check if the output buffer contains one of our special
                    * markers indicating the need of a special response and process
                    * accordingly. */
                    if( strncmp( pcOutputBuffer, "PCAP-GET", ulResponseLength ) == 0 )
                    {
                        const uint8_t * pucPcapData;
                        uint32_t ulPcapDataLength;

                        pcap_capture_get_captured_data( &( pucPcapData ),
                                                        &( ulPcapDataLength) );

                        xResponseSent = prvSendCommandResponse( xCLIServerSocket,
                                                                &( xSourceAddress ),
                                                                xSourceAddressLength,
                                                                &( ucPacketNumber ),
                                                                &( ucRequestId [ 0 ] ),
                                                                pucPcapData,
                                                                ulPcapDataLength );

                        /* Next fetch should not get the same capture but the capture
                        * after this point. */
                        pcap_capture_reset();
                    }
                    else
                    {
                        /* Send the command response. */
                        xResponseSent = prvSendCommandResponse( xCLIServerSocket,
                                                                &( xSourceAddress ),
                                                                xSourceAddressLength,
                                                                &( ucPacketNumber ),
                                                                &( ucRequestId [ 0 ] ),
                                                                ( const uint8_t * ) pcOutputBuffer,
                                                                ulResponseLength );
                    }

                    if( xResponseSent == pdPASS )
                    {
                        configPRINTF( ( "Response sent successfully. \n" ) );
                    }
                    else
                    {
                        configPRINTF( ( "[ERROR] Failed to send response. \n" ) );
                    }
                } while( xResponseRemaining == pdTRUE );

                /* Send the last packet with zero payload length. */
                ( void ) prvSendResponseEndMarker( xCLIServerSocket,
                                                &( xSourceAddress ),
                                                xSourceAddressLength,
                                                &( ucPacketNumber ),
                                                &( ucRequestId [ 0 ] ) );
            }
            else
            {

                #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                    configPRINTF( ( "[ERROR] Malformed request. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                            xSourceAddress.sin_port,
                                                                                            cInputCommandString ) );
                #else
                    configPRINTF( ( "[ERROR] Malformed request. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                                                                            xSourceAddress.sin_port,
                                                                                            cInputCommandString ) );
                #endif
                

            }
        }
    }

#endif /* USE_UDP */

#if USE_TCP

    static void prvCliTask_TCP( void *pvParameters )
    {
        struct freertos_sockaddr xClient;
        socklen_t xSize = sizeof( xClient );
        Socket_t xListeningSocket = FREERTOS_INVALID_SOCKET, xConnectedSocket = FREERTOS_INVALID_SOCKET;
        struct freertos_sockaddr xServerAddress;
        TickType_t xCLIServerRecvTimeout = portMAX_DELAY;
        const BaseType_t xBacklog = 20;

        ( void ) pvParameters;

        xListeningSocket = FreeRTOS_socket( FREERTOS_AF_INET,
                                            FREERTOS_SOCK_STREAM,
                                            FREERTOS_IPPROTO_TCP );
        configASSERT( xListeningSocket != FREERTOS_INVALID_SOCKET );

        /* No need to return from FreeRTOS_recvfrom until a message
        * is received. */
        FreeRTOS_setsockopt( xListeningSocket,
                            0,
                            FREERTOS_SO_RCVTIMEO,
                            &( xCLIServerRecvTimeout ),
                            sizeof( TickType_t ) );

        xServerAddress.sin_port = FreeRTOS_htons( configCLI_SERVER_PORT );

        #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
            xServerAddress.sin_address.ulIP_IPv4 = FreeRTOS_GetIPAddress();
        #else
            xServerAddress.sin_addr = FreeRTOS_GetIPAddress();
        #endif

        FreeRTOS_bind( xListeningSocket, &( xServerAddress ), sizeof( xServerAddress ) );

        /* start listening */
        FreeRTOS_listen( xListeningSocket, xBacklog );

        for( ;; )
        {
            /* Wait for a client to connect. */
            xConnectedSocket = FreeRTOS_accept( xListeningSocket, &xClient, &xSize );
            configASSERT( xConnectedSocket != FREERTOS_INVALID_SOCKET );

            /* Spawn a task to handle the connection. */
            xTaskCreate( TCP_Server_Task, "CLI TCP Server Instance", mainCLI_TASK_STACK_SIZE, ( void * ) xConnectedSocket, mainCLI_TASK_PRIORITY, NULL );
        }

    }

    static void TCP_Server_Task(void *pvParams)
    {

