tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
        uint32_t ulResponseLength;
        BaseType_t xCount, xResponseRemaining, xResponseSent;
        Socket_t xCLIServerSocket = (Socket_t) pvParams;
        struct freertos_sockaddr xSourceAddress;
        socklen_t xSourceAddressLength = sizeof( xSourceAddress );
        char * pcOutputBuffer = FreeRTOS_CLIGetOutputBuffer();
        static const TickType_t xReceiveTimeOut = pdMS_TO_TICKS( 5000 );
        static const TickType_t xSendTimeOut = pdMS_TO_TICKS( 5000 );
        uint8_t *pucRxBuffer = NULL;

        /* Attempt to create the buffer used to receive the string to be echoed
        back.  This could be avoided using a zero copy interface that just returned
        the same buffer. */
        pucRxBuffer = ( uint8_t * ) pvPortMalloc( ipconfigTCP_MSS );
        configASSERT(pucRxBuffer != NULL);

        FreeRTOS_setsockopt( xCLIServerSocket, 0, FREERTOS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );
        FreeRTOS_setsockopt( xCLIServerSocket, 0, FREERTOS_SO_SNDTIMEO, &xSendTimeOut, sizeof( xReceiveTimeOut ) );
        
        for( ;; )
        {

            /* Zero out the receive array so there is NULL at the end of the string
            when it is printed out. */
            memset( pucRxBuffer, 0x00, ipconfigTCP_MSS );

            uint8_t ucRequestId[ 4 ];

    #if USE_TCP_ZERO_COPY


    #else

                xCount = FreeRTOS_recv( xCLIServerSocket, pucRxBuffer, ipconfigTCP_MSS, 0 );

    #endif /* USE_TCP_ZERO_COPY */

            /* Since we set the receive timeout to portMAX_DELAY, the
            * above call should only return when a command is received. */
            //configASSERT( xCount > 0 );

            if( xCount > 0 )
            {
                configASSERT( xCount < configMAX_COMMAND_INPUT_SIZE);

                memcpy(cInputCommandString, pucRxBuffer, xCount);
                cInputCommandString[ xCount ] = '\0';

                /* Echo the response back */
                /* prvSendResponseBytes_TCP(xCLIServerSocket, cInputCommandString, xCount + 1); */

                if( prvIsValidRequest( ( const uint8_t * ) &( cInputCommandString[ 0 ] ), xCount, &( ucRequestId[ 0 ] ) ) == pdTRUE )
                {
                    uint8_t ucPacketNumber = 1;
    #ifdef TIM7_TEST
                    extern uint32_t tim7_period;

                    #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                        xSourceAddress.sin_port,
                                                                                        &( cInputCommandString[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                    #else
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_addr,
                                                                                        xSourceAddress.sin_port,
                                                                                        &( cInputCommandString[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                    #endif

    #else

                    #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                        xSourceAddress.sin_port,
                                                                                        &( cInputCommandString[ PACKET_HEADER_LENGTH ] ) ) );
                    #else
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                                                                        xSourceAddress.sin_port,
                                                                                        &( cInputCommandString[ PACKET_HEADER_LENGTH ] ) ) );
                    #endif

    #endif
                    do
                    {
                        /* Send the received command to the FreeRTOS+CLI. */
                        xResponseRemaining = FreeRTOS_CLIProcessCommand( &( cInputCommandString[ PACKET_HEADER_LENGTH ] ),
                                                                            pcOutputBuffer,
                                                                            configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 );

                        /* Ensure null termination so that the strlen below does not
                        * end up reading past bounds. */
                        pcOutputBuffer[ configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 ] = '\0';

                        ulResponseLength = strlen( pcOutputBuffer );

                        /* HACK - Check if the output buffer contains one of our special
                        * markers indicating the need of a special response and process
                        * accordingly. */
                        if( strncmp( pcOutputBuffer, "PCAP-GET", ulResponseLength ) == 0 )
                        {
                            const uint8_t * pucPcapData;
                            uint32_t ulPcapDataLength;

                            pcap_capture_get_captured_data( &( pucPcapData ),
                                                            &( ulPcapDataLength) );

                            xResponseSent = prvSendCommandResponse_TCP( xCLIServerSocket,
                                                                    &( xSourceAddress ),
                                                                    xSourceAddressLength,
                                                                    &( ucPacketNumber ),
                                                                    &( ucRequestId [ 0 ] ),
                                                                    pucPcapData,
                                                                    ulPcapDataLength );

                            /* Next fetch should not get the same capture but the capture
                            * after this point. */
                            pcap_capture_reset();
                        }
                        else
                        {
                            /* Send the command response. */
                            xResponseSent = prvSendCommandResponse_TCP( xCLIServerSocket,
                                                                    &( xSourceAddress ),
                                                                    xSourceAddressLength,
                                                                    &( ucPacketNumber ),
                                                                    &( ucRequestId [ 0 ] ),
                                                                    ( const uint8_t * ) pcOutputBuffer,
                                                                    ulResponseLength );
                        }

                        if( xResponseSent == pdPASS )
                        {
                            configPRINTF( ( "Response sent successfully. \n" ) );
                        }
                        else
                        {
                            configPRINTF( ( "[ERROR] Failed to send response. \n" ) );
                        }
                    } while( xResponseRemaining == pdTRUE );

                    /* Send the last packet with zero payload length. */
                    ( void ) prvSendResponseEndMarker_TCP( xCLIServerSocket,
                                                    &( xSourceAddress ),
                                                    xSourceAddressLength,
                                                    &( ucPacketNumber ),
                                                    &( ucRequestId [ 0 ] ) );
                }
                else
                {

                    #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                        configPRINTF( ( "[ERROR] Malformed request. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                                xSourceAddress.sin_port,
                                                                                                cInputCommandString ) );
                    #else
                        configPRINTF( ( "[ERROR] Malformed request. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                                                                                xSourceAddress.sin_port,
                                                                                                cInputCommandString ) );
                    #endif
                    

