tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
                }
            }
        }
    }

#endif
/*-----------------------------------------------------------*/

static void prvRegisterCLICommands( void )
{
extern void vRegisterPingCommand( void );
extern void vRegisterPcapCommand( void );
extern void vRegisterNetStatCommand( void );
extern void vRegisterTopCommand( void );

    vRegisterPingCommand();
    vRegisterPcapCommand();
    vRegisterNetStatCommand();
    vRegisterTopCommand();
}
/*-----------------------------------------------------------*/

static void prvConfigureMPU( void )
{
    MPU_Region_InitTypeDef MPU_InitStruct;

    HAL_MPU_Disable();

    /*  Configure the MPU attributes of RAM_D2 ( which contains .ethernet_data )
     * as Write back, Read allocate, Write allocate. */
    MPU_InitStruct.Enable           = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress      = 0x30000000;
    MPU_InitStruct.Size             = MPU_REGION_SIZE_256KB;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
    MPU_InitStruct.IsCacheable      = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsShareable      = MPU_ACCESS_SHAREABLE;
    MPU_InitStruct.Number           = MPU_REGION_NUMBER0;
    MPU_InitStruct.TypeExtField     = MPU_TEX_LEVEL1;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec      = MPU_INSTRUCTION_ACCESS_ENABLE;

    HAL_MPU_ConfigRegion( &( MPU_InitStruct ) );

    HAL_MPU_Enable( MPU_PRIVILEGED_DEFAULT );
}
/*-----------------------------------------------------------*/

static BaseType_t prvIsValidRequest( const uint8_t * pucPacket, uint32_t ulPacketLength, uint8_t * pucRequestId )
{
    BaseType_t xValidRequest = pdFALSE;
    PacketHeader_t * header;
    uint16_t usPayloadLength;

    if( ulPacketLength > PACKET_HEADER_LENGTH )
    {
        header = ( PacketHeader_t * )pucPacket;
        usPayloadLength = FreeRTOS_ntohs( header->usPayloadLength );

        if( ( header->ucStartMarker == PACKET_START_MARKER ) &&
            ( header->ucPacketNumber == 1 ) &&
            ( ( usPayloadLength + PACKET_HEADER_LENGTH ) == ulPacketLength ) )
        {
            xValidRequest = pdTRUE;
            memcpy( pucRequestId, &( header->ucRequestId[ 0 ] ), 4 );
        }
    }

    return xValidRequest;
}
/*-----------------------------------------------------------*/

#if USE_TCP

    static BaseType_t prvSendResponseEndMarker_TCP( Socket_t xCLIServerSocket,
                                                struct freertos_sockaddr * pxSourceAddress,
                                                socklen_t xSourceAddressLength,
                                                uint8_t *pucPacketNumber,
                                                uint8_t *pucRequestId )
    {
        BaseType_t ret = pdPASS;
        int32_t lBytes, lSent, lTotalSent;
        PacketHeader_t header;

        header.ucStartMarker = PACKET_START_MARKER;
        header.ucPacketNumber = *pucPacketNumber;
        header.usPayloadLength = 0U;
        memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

    #if USE_TCP_ZERO_COPY

    #else

            /* Send response. */

            lBytes = sizeof( PacketHeader_t );
            lSent = 0;
            lTotalSent = 0;

            /* Call send() until all the data has been sent. */
            while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
            {
                lSent = FreeRTOS_send( xCLIServerSocket, ( void * ) ( &header ), lBytes - lTotalSent, 0 );
                lTotalSent += lSent;
            }

            if( lSent < 0 )
            {
                /* Socket closed? */
                ret = pdFAIL;
            }

    #endif /* USE_ZERO_COPY */

        if( lTotalSent != PACKET_HEADER_LENGTH )
        {
            configPRINTF( ("[ERROR] Failed to last response header.\n" ) );
            ret = pdFAIL;
        }

        return ret;
    }

#endif /* USE_TCP */

/*-----------------------------------------------------------*/

#if USE_UDP

    static BaseType_t prvSendResponseEndMarker( Socket_t xCLIServerSocket,
                                                struct freertos_sockaddr * pxSourceAddress,
                                                socklen_t xSourceAddressLength,
                                                uint8_t *pucPacketNumber,
                                                uint8_t *pucRequestId )
    {
        BaseType_t ret;
        PacketHeader_t header;
        int32_t lBytesSent;

        header.ucStartMarker = PACKET_START_MARKER;
        header.ucPacketNumber = *pucPacketNumber;
        header.usPayloadLength = 0U;
        memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

    #if USE_ZERO_COPY
            /*
            * First obtain a buffer of adequate length from the TCP/IP stack into which
            the string will be written. */
    #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
            uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( sizeof( PacketHeader_t ), portMAX_DELAY, ipTYPE_IPv4 );
    #else
            uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer( sizeof( PacketHeader_t ), portMAX_DELAY );
    #endif
            configASSERT( pucBuffer != NULL );
            memcpy( pucBuffer , &header, sizeof( PacketHeader_t ) );

            lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                        ( void * ) ( pucBuffer ),
                                        sizeof( PacketHeader_t ),
                                        FREERTOS_ZERO_COPY,
                                        pxSourceAddress,
                                        xSourceAddressLength );
    #else

            lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                        ( void * ) ( &header ),
                                        sizeof( PacketHeader_t ),
                                        0,
                                        pxSourceAddress,
                                        xSourceAddressLength );

    #endif /* USE_ZERO_COPY */

