tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
        if( lBytesSent != PACKET_HEADER_LENGTH )
        {
            configPRINTF( ("[ERROR] Failed to last response header.\n" ) );
            ret = pdFAIL;
        }

        return ret;
    }

    /*-----------------------------------------------------------*/

    static BaseType_t prvSendCommandResponse( Socket_t xCLIServerSocket,
                                            struct freertos_sockaddr * pxSourceAddress,
                                            socklen_t xSourceAddressLength,
                                            uint8_t *pucPacketNumber,
                                            uint8_t *pucRequestId,
                                            const uint8_t * pucResponse,
                                            uint32_t ulResponseLength )
    {
        BaseType_t ret = pdPASS;
        PacketHeader_t header;
        int32_t lBytesSent;
        uint32_t ulBytesToSend, ulRemainingBytes, ulBytesSent;

        ulRemainingBytes = ulResponseLength;
        ulBytesSent = 0;

        while( ulRemainingBytes > 0 )
        {
            ulBytesToSend = ulRemainingBytes;

            if( ulBytesToSend > mainMAX_UDP_RESPONSE_SIZE )
            {
                ulBytesToSend = mainMAX_UDP_RESPONSE_SIZE;
            }

            /* Write header to the response buffer. */
            header.ucStartMarker = PACKET_START_MARKER;
            header.ucPacketNumber = *pucPacketNumber;
            *pucPacketNumber = ( *pucPacketNumber ) + 1;
            header.usPayloadLength = FreeRTOS_htons( ( uint16_t ) ulBytesToSend );
            memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

            memcpy( &( ucUdpResponseBuffer[ 0 ] ),
                    &( header ),
                    PACKET_HEADER_LENGTH );

            /* Write actual response to the buffer. */
            memcpy( &( ucUdpResponseBuffer[ PACKET_HEADER_LENGTH] ),
                    &( pucResponse[ ulBytesSent ] ),
                    ulBytesToSend );



    #if USE_ZERO_COPY
                /*
                * First obtain a buffer of adequate length from the TCP/IP stack into which
                the string will be written. */
    #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( ulBytesToSend + PACKET_HEADER_LENGTH, portMAX_DELAY, ipTYPE_IPv4 );
    #else
                uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer( ulBytesToSend + PACKET_HEADER_LENGTH, portMAX_DELAY );
    #endif
                configASSERT( pucBuffer != NULL );
                memcpy( pucBuffer , &( ucUdpResponseBuffer[ 0 ] ), ulBytesToSend + PACKET_HEADER_LENGTH );

                /* Send response. */
                lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                            ( void * ) pucBuffer,
                                            ulBytesToSend + PACKET_HEADER_LENGTH,
                                            FREERTOS_ZERO_COPY,
                                            pxSourceAddress,
                                            xSourceAddressLength );
    #else

                /* Send response. */
                lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                            ( void * ) &( ucUdpResponseBuffer[ 0 ] ),
                                            ulBytesToSend + PACKET_HEADER_LENGTH,
                                            0,
                                            pxSourceAddress,
                                            xSourceAddressLength );

    #endif /* USE_ZERO_COPY */

            if( lBytesSent != ( ulBytesToSend + PACKET_HEADER_LENGTH ) )
            {
                configPRINTF( ("[ERROR] Failed to send response.\n" ) );
                ret = pdFAIL;
                break;
            }

            ulRemainingBytes -= ulBytesToSend;
            ulBytesSent += ulBytesToSend;
        }

        return ret;
    }

#endif /* USE UDP */

#if USE_TCP

    static BaseType_t prvSendCommandResponse_TCP( Socket_t xCLIServerSocket,
                                            struct freertos_sockaddr * pxSourceAddress,
                                            socklen_t xSourceAddressLength,
                                            uint8_t *pucPacketNumber,
                                            uint8_t *pucRequestId,
                                            const uint8_t * pucResponse,
                                            uint32_t ulResponseLength )
    {
        BaseType_t ret = pdPASS;
        PacketHeader_t header;
        uint32_t ulBytesToSend, ulRemainingBytes, ulBytesSent;
        int32_t lBytes, lSent, lTotalSent;

        ulRemainingBytes = ulResponseLength;
        ulBytesSent = 0;

        while( ulRemainingBytes > 0 )
        {
            ulBytesToSend = ulRemainingBytes;


            /* Write header to the response buffer. */
            header.ucStartMarker = PACKET_START_MARKER;
            header.ucPacketNumber = *pucPacketNumber;
            *pucPacketNumber = ( *pucPacketNumber ) + 1;
            header.usPayloadLength = FreeRTOS_htons( ( uint16_t ) ulBytesToSend );
            memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

            memcpy( &( ucTcpResponseBuffer[ 0 ] ),
                    &( header ),
                    PACKET_HEADER_LENGTH );

            /* Write actual response to the buffer. */
            memcpy( &( ucTcpResponseBuffer[ PACKET_HEADER_LENGTH] ),
                    &( pucResponse[ ulBytesSent ] ),
                    ulBytesToSend );



    #if USE_TCP_ZERO_COPY

    #else

                /* Send response. */

                lBytes = ulBytesToSend + PACKET_HEADER_LENGTH;
                lSent = 0;
                lTotalSent = 0;

                /* Call send() until all the data has been sent. */
                while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
                {
                    lSent = FreeRTOS_send( xCLIServerSocket, ucTcpResponseBuffer, lBytes - lTotalSent, 0 );
                    lTotalSent += lSent;
                }

                if( lSent < 0 )
                {
                    /* Socket closed? */
                    break;
                }

    #endif /* USE_ZERO_COPY */

            if( lSent != ( ulBytesToSend + PACKET_HEADER_LENGTH ) )
            {
                configPRINTF( ("[ERROR] Failed to send response.\n" ) );
                ret = pdFAIL;
                break;
            }

